Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: །ཁྲོ་གཉེར་མེད་ཅིང་རྟག་ཏུ་གསོང་པོར་སྨྲ་བར་འགྱུར།
en: Do not frown, always speak sincerely,

source: །བཞིན་ཡང་འཛུམ་ཞིང་འདྲེན་པ་དག་གི་རྗེས་སུ་སློབ།
en: Have a smiling face, and have been instructed by the guides. {4}

source: །དེས་ཤིང་འགྲོགས་ན་བདེ་ལ་འཇམ་པའི་སེམས་སུ་འགྱུར།
en: Are pleasant, good company, have a gentle mind,

source: །རྟག་པར་རབ་ཏུ་དུལ་ཞིང་དུལ་བའི་ས་ལ་གནས།
en: Are always restrained and established in self-discipline,

source: །འཇམ་ཞིང་དགའ་བའི་ཚིག་སྨྲ་ཤིན་ཏུ་བདེ་བར་ཟེར།
en: And are very gentle, have pleasing speech, and speak tenderly. {5}

source: །དེ་ནི་གཏམ་བྱེད་འགྱུར་ཡང་རྩོད་ཅིང་འཐབ་པ་མེད།
en: Do not quarrel or cause conflict when they speak.

source: །ཞེ་སྡང་ཐ་བ་དེ་དག་མ་ལུས་རྣམ་སྤངས་ཏེ།
en: They have freed themselves from all stubbornness and anger

source: །རྟག་པར་རབ་ཏུ་དགའ་ཞིང་དེས་ལ་མཉེན་པ་ཡིན།
en: And are always joyful, pleasant, and gentle. {6}

source: །མཁས་པ་རྟག་ཏུ་གཏོང་ལ་མོས་པར་རབ་འགྱུར་ཏེ།
en: Are always wise and are constantly motivated to generosity.

source: །ཤིན་ཏུ་སྡུག་བསྔལ་སྐྱེ་བོ་མཐོང་ནས་ཁ་ཟས་སྦྱིན།
en: When they see beings in great suffering they give them their food;

source: །གཏོང་ལ་ཤིན་ཏུ་དགའ་ཞིང་བདག་ཉིད་སྤྱོད་མི་དགའ།
en: They delight in giving to others, and not in their own enjoyment. {7}

source: །ལྷ་ཡང་བརྒྱ་སྟོང་དེ་ལ་སྨོན་པ་ཤིན་ཏུ་སྐྱེད།
en: Are admired by a hundred thousand devas,

source: །ཀླུ་དང་ལྷ་མིན་གནོད་སྦྱིན་རྟག་ཏུ་གཡོག་བྱེད་དེ།
en: Are always attended by nāgas, asuras, and yakṣas,

source: །ནགས་དང་ནགས་འདབས་གནས་པ་དེ་ལ་སྲུང་བར་བྱེད།
en: And are protected by those who dwell in the forest and its environs. {8}

source: །ཚིག་ནི་ཐོགས་པ་མེད་ཅིང་ཚངས་པའི་སྒྲ་དབྱངས་ཏེ།
en: “They speak with unimpeded words, like the voice of Brahmā,

source: །ངང་པའི་སྒྲ་སྐད་མིའམ་ཅི་ཡི་གླུ་ཡི་དབྱངས།
en: Have a voice like the song of a goose, a voice like a kinnara’s song,

source: །དབྱངས་ཀྱི་ཡན་ལག་ལྔ་བརྒྱ་དགའ་བའི་སྒྲ་སྐད་དེ།
en: Have the fifty aspects of speech and have a sound that brings joy,

source: །སྒྲ་སྒྲགས་ཤིན་ཏུ་གྲགས་པའི་སྒྲ་ཡི་མཆོག་ཏུ་འགྱུར།
en: And have a resounding voice, a proclaiming voice, a perfect voice. {9} “Even if someone knew how to reduce

source: །ཇི་སྙེད་ཞིང་རྣམས་དེ་དག་སྐྱེས་བུ་ལ་ལ་ཡིས། །ཕྲ་བའི་རྡུལ་དུ་བྱས་པ་ཤེས་པར་ནུས་ཀྱང་ནི།
en: All the worlds into their smallest particles,

source: །ཏིང་འཛིན་རྡུལ་བྲལ་མཆོག་འདི་མི་གང་འཛིན་པ་དག །དེ་ཡི་དབྱངས་སྒྲ་དེ་བས་ཤིན་ཏུ་མང་བར་འགྱུར།
en: They who possess this supreme, stainless samādhi Would voice sounds that were even more numerous. {10}

source: །ཏིང་འཛིན་རྡུལ་བྲལ་འདི་ཡང་མི་གང་འཛིན་པ་ནི།
en: “They who possess this stainless samādhi

source: །དབང་བཅུ་འཐོབ་ཅིང་ས་ཡང་བརྒྱད་དང་གཉིས་འཐོབ་སྟེ།
en: Attain the ten powers, and attain the eight and two bhūmis.

source: །མཁས་པས་སངས་རྒྱས་ཆོས་རྣམས་བསམ་ཡས་འཐོབ་པར་འགྱུར།
en: The wise ones attain the inconceivable qualities of a buddha,

source: །བདུད་རྣམས་ཐམས་ཅད་བཏུལ་ནས་བྱང་ཆུབ་དམ་པ་རིག །ཕན་ཡོན་གྱི་ལེའུ་སྟེ་སུམ་ཅུ་རྩ་གཅིག་པའོ།། །།
en: Subjugate all māras, and reach the highest enlightenment.” {i} Conclusion of the thirty-first chapter, “Benefits.”

source: དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ།
en: The Teaching on the Nature of All Phenomena Chapter 32

source: གཞོན་ནུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཇི་ལྟར་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་ཤེས་པར་བྱ་སྙམ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པའི་ཏིང་ངེ་འཛིན་འདི་མཉན་པར་བྱ། གཟུང་བར་བྱ། ཀུན་ཆུབ་པར་བྱ། བཅང་བར་བྱ། བཀླག་པར་བྱ། རབ་ཏུ་གདོན་པར་བྱ། ལུང་མནོད་ཅིང་ཁ་ཏོན་དུ་བྱ། ཉོན་མོངས་པ་མེད་པའི་བསྒོམ་པས་བསྒོམ་པར་བྱ། མང་དུ་བྱ། གཞན་ལ་ཡང་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱའོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ།
en: Then the Bhagavān said to the youth Candraprabha, “Therefore, young man, bodhisattva mahāsattvas who wonder, ‘How can I know the nature of all phenomena?’ should listen to this samādhi, the revealed equality of the nature of all phenomena, learn it, understand it, keep it, recite it to others, promote it, proclaim it, chant it, meditate on it with unadulterated meditation, promulgate it, and make it widely known to others.” Thereupon the Bhagavān spoke these verses:

source: །ཆོས་ཀྱི་རང་བཞིན་ཤིན་ཏུ་ཞི་བ་གང་ཤེས་པ།
en: “In the ones who know the peace that is the nature of phenomena

source: །དེ་ལ་འདོད་ཆགས་ལྡང་བ་མེད་ཅིང་ཞེ་སྡང་མེད།
en: No desire arises, no anger arises,

source: །ཁྱུ་མཆོག་ལ་ནི་ནམ་ཡང་གཏི་མུག་ལྡང་བ་མེད།
en: Nor in those great leaders does ignorance ever arise.

source: །དེས་ནི་ཉོན་མོངས་མ་ལུས་ཐམས་ཅད་སྤངས་པ་ཡིན།
en: They have eliminated all kleśas without remainder. {1}

source: །དེ་ནི་བདེ་གཤེགས་ཐུགས་སྲས་བསླབས་པ་ཡོང་མི་འདོར།
en: Are heart children of the Sugata who do not abandon the training.

source: །དཔའ་བོ་བུད་མེད་དབང་དུ་ནམ་ཡང་མི་འགྲོ་སྟེ།
en: They are heroes who never fall under the power of women.

source: །དེ་དང་དེར་ནི་བདེ་གཤེགས་བསྟན་པའི་དགའ་བ་མྱོང་།
en: Everywhere they rejoice in the teaching of the sugatas. {2}

source: །ཆོས་ཀྱི་རང་བཞིན་ཚུལ་གྱི་རིགས་པ་གང་ཤེས་པ།
en: “They who know the peace that is the nature of phenomena

source: །དེ་ནི་མཁས་པ་བློ་ལྡན་ཡེ་ཤེས་ཆོ་ག་ཤེས།
en: Are wise, sagacious, and know the way of wisdom.

source: །དེ་དང་དེ་ནི་སངས་རྒྱས་མཐའ་ཡས་མུ་མེད་མཐོང་།
en: They see infinite, endless buddhas

source: །དེ་ནི་གཟུགས་དང་ཡེ་ཤེས་མཐའ་ཡས་རབ་ཏུ་ཤེས།
en: And know infinite dhāraṇīs and wisdom. {3}

source: །དེ་ནི་རིང་པོར་མི་ཐོགས་རྐང་གཉིས་གཙོ་བོར་འགྱུར།
en: Will before long become a lord of humans.

source: །དེ་དང་དེ་ནི་སྨན་པ་དཔྱད་ཤེས་བདེ་བ་སྦྱིན་པར་འགྱུར།
en: They know the skills of healing and bestow happiness,

source: །དེ་ནི་སྡུག་བསྔལ་ཟུག་རྔུ་ཐམས་ཅད་འབྱིན་པར་བྱེད།
en: And they are able to remove all the pain of suffering. {4}

source: །དེ་ནི་སེམས་ཅན་འདི་དག་སྡུག་བསྔལ་ན་རིག་ནས།
en: Know that sentient beings are suffering.

source: །དེ་ནི་རྟག་ཏུ་བདུད་རྩི་དག་གི་རྔ་དག་རྡུང་།
en: They always beat the drum of the elixir.

source: །དེ་དང་དེ་ནི་རིང་པོར་མི་ཐོགས་འདྲེན་པར་འགྱུར།
en: They will before long become a guide. {5}

source: །དེ་ནི་སྨན་གྱི་ཚུལ་ལ་མཁས་པ་སྨན་པའི་མཆོག །ཐམས་ཅད་ནད་ཀྱི་གཞི་དང་གང་གིས་འཐར་པ་ཤེས།
en: “They are the supreme physicians, skilled in healing. They know the origin of all illnesses and how to be freed from them.

source: །དེ་ནི་ཡང་དག་ཚུལ་ལ་བསླབས་པ་བློ་གྲོས་ལྡན།
en: They have wisdom and train correctly.

source: །བསླབས་ནས་ཤིན་ཏུ་འཁྱམས་པའི་སེམས་ཅན་མང་པོ་འགྲོལ།
en: Having trained they liberate many lost beings. {6}

source: །དེ་ནི་སྟོང་པ་ཉིད་ཀྱི་ཚུལ་མཁས་བློ་གྲོས་དཔའ།
en: Are wise heroes who are skilled in the nature of emptiness.

source: །དེ་ནི་འཇིག་རྟེན་རྟག་ཏུ་མ་ཆགས་བསོད་སྙོམས་ཟ།
en: They have no attachment to the world and always their food is alms,

source: །དེ་ནི་སེམས་ཅན་མང་པོ་བྱང་ཆུབ་མཆོག་ལ་འགོད།
en: And they bring many beings to supreme enlightenment. {7}

source: །དེ་ནི་མི་ཡི་ཟླ་བ་བཟོད་པའི་སྟོབས་ཀྱིས་འཕགས།
en: Are moons among people, superior through the power of patience.

source: །དེ་ནི་རྡོ་དང་དབྱུག་པས་བརྡེགས་ཀྱང་མི་ཁྲོ་སྟེ།
en: They are not angry even if struck with stones and sticks,

source: །དེ་ནི་ལུས་དང་ཡན་ལག་བཅད་ཀྱང་འཁྲུག་པ་མེད།
en: And they are not disturbed even if their limbs are severed. {8}

source: །དེ་ནི་བཟོད་པའི་སྟོབས་ལ་གནས་པ་སྟོབས་ལྡན་ཡིན།
en: Have the strength of being established in the strength of patience.

source: །དེ་ནི་རབ་ཏུ་ཞི་བའི་བཟོད་པའི་དངོས་མི་གཏོང་།
en: Not seeing a thing that is tolerated, they are perfectly at peace.

source: །དེ་ནི་བློ་དཔའ་བཟོད་པའི་སྟོབས་ལ་རློམ་སེམས་མེད།
en: They are wise heroes who do not become proud of the strength of their patience. {9}

source: །དེ་ནི་བདག་བཅད་སྙམ་དུ་ནམས་ཀྱང་སེམས་མི་འགྱུར།
en: Never have in mind the idea ‘I am cutting through things’;

source: །དེ་ཡིས་སྲིད་པ་ཐམས་ཅད་རྣམ་བཤིག་རྟག་ཏུ་སྟོང་།
en: For them all things are nonexistent, always empty,

source: །དེ་ཡི་འདུ་ཤེས་ཐམས་ཅད་མ་ལུས་རབ་ཏུ་སྤངས།
en: And they have eliminated every single conceptual identification. {10}

source: །དེ་དང་དེ་དག་ཆོས་ཀྱི་རང་བཞིན་དམ་པ་སྟོན།
en: “Such are they who teach the supreme nature of phenomena.

source: །དེ་དག་རིང་པོར་མི་ཐོགས་བླ་མེད་བྱང་ཆུབ་རེག །གང་དག་ཆོས་ཀྱི་རང་བཞིན་སྤྱོད་ཡུལ་ངེས་རྟོགས་པ།
en: They will before long reach the highest enlightenment. They comprehend the scope of the nature of phenomena.

source: །དེ་དག་གིས་ནི་སྦྱིན་པ་མཐའ་ཡས་མུ་མེད་བྱིན།
en: They give a gift that is infinite and endless. {11}

source: །དེ་ནི་མདོ་སྡེ་བྱེ་བ་མཐའ་ཡས་འཆད་པར་བྱེད།
en: Teach infinite millions of sūtras

source: །དེ་ལས་ལྷག་པར་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད།
en: That are more numerous than sand grains in the Ganges,

source: །བཤད་ཀྱང་དེ་ཡི་སྤོབས་པའི་རྒྱུན་ནི་འཆད་པ་མེད།
en: And there is no interruption in their eloquence. {12}

source: །དེ་ནི་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་སྟོང་དུ་ཡང་། །ཡེ་ཤེས་དག་ནི་རྟག་ཏུ་འཕགས་པ་རི་རབ་བཞིན།
en: Constantly for a hundred trillion eons,

source: །ཆོས་རྣམས་སྟོན་པ་དག་ནི་ཟད་པར་ཡོང་མི་འགྱུར།
en: And their teaching of the Dharma knows no end. {13}

source: །སྤོབས་པ་ཡངས་ཤིང་རྒྱ་ཆེ་བསམ་གྱིས་མི་ཁྱབ་འགྱུར།
en: Have a vast, abundant, inconceivable eloquence.

source: །བྱང་ཆུབ་དམ་པ་རྟག་ཏུ་ཁོར་མོར་ཚོལ་བ་ན།
en: They constantly seek supreme enlightenment

source: །མདོ་སྡེ་དག་ཀྱང་བྱེ་བ་མཐའ་ཡས་རབ་ཏུ་འཆད།
en: And teach infinite millions of sūtras. {14}

source: །ཆོས་འདི་ཐམས་ཅད་དངོས་པོ་མེད་པར་གང་ཤེས་པ། །རྐང་གཉིས་གཙོ་བོས་ཆོས་གང་ཇི་སྙེད་བཤད་པ་ཡང་།
en: “They who know that these phenomena have no substance

source: །དེ་དག་ཐམས་ཅད་ཐོས་ནས་ཡོངས་སུ་རྫོགས་པར་འཛིན།
en: Perfectly hear and remember the entirety Of the Dharma that the lords of humans have taught

source: །དེ་ནི་ཚིག་གཅིག་ལ་ཡང་ཐེ་ཚོམ་འབྱུང་མི་འགྱུར།
en: And do not doubt even a single word. {15}

source: །ཆོས་ཀྱི་རང་བཞིན་རྟག་ཏུ་སྟོང་པར་གང་ཤེས་པ།
en: “They who know that phenomena are always empty

source: །དེ་ནི་རྟག་ཏུ་བྱེ་བྲག་འཕགས་ཤིང་གཏོང་ལྡན་འགྱུར།
en: Are at all times uniquely superior in their generosity.

source: །སྡུག་བསྔལ་དག་ལ་བདེ་བ་སྦྱིན་པའི་སྦྱིན་བདག་ཡིན།
en: They are patrons who give happiness to those who suffer.

source: །སེམས་ཅན་སྡུག་བསྔལ་མཐོང་ནས་རིན་ཆེན་ཚིམ་པར་བྱེད།
en: When they see beings suffer they satisfy them with jewels. {16}

source: །དེ་ནི་རྟག་ཏུ་འཛམ་བུ་རྒྱལ་མཚན་རྒྱལ་པོར་འགྱུར།
en: Will always become the kings of Jambudhvaja.

source: །དུས་ཀུན་དུ་ཡང་སྲོག་ཆགས་རྣམས་ལ་བྱམས་ལྡན་ཏེ།
en: At all times they have love for all the living

source: །རྟག་ཏུ་མཐའ་ཡས་པ་ཡི་བདེ་བ་བྱེད་པར་འགྱུར།
en: And always bring infinite happiness to beings. {17}

source: །དཔའ་བོ་བུ་དང་བུ་མོ་བྲན་དག་གཏོང་བར་བྱེད།
en: Are heroes who give away their sons, daughters, and slaves. Those great leaders’ minds never waver,

source: །མགོ་དང་ལག་པ་དེ་བཞིན་རྒྱལ་སྲིད་ཡོངས་སུ་གཏོང་། །ཁྱུ་མཆོག་དེ་ཡི་ཡིད་ནི་ཞུམ་པར་ཡོང་མི་འགྱུར།
en: As they give away their hands, their feet, their head, and their kingdom. {18}

source: །དེ་ཡི་ལུས་དང་ཡན་ལག་གལ་ཏེ་བཅད་གྱུར་ཀྱང་། །རྨི་ལམ་ན་ཡང་དེ་ཡི་ཡིད་ལ་ཁོང་ཁྲོ་མེད།
en: Have no anger in their mind, even in a dream, Even though their limbs are cut from their body;

source: །དེས་ནི་འདྲེན་པ་རྐང་གཉིས་གཙོ་བོ་མཆོད་པ་ཡིན།
en: For them it is an offering to the guides, the lords of humans. {19}

source: །དེས་ནི་འདས་པའི་འདྲེན་པ་ཐམས་ཅད་མཆོད་པ་ཡིན།
en: Make offerings to all the guides of the past,

source: །དེ་བཞིན་མ་བྱོན་པ་ཡི་རྐང་གཉིས་གཙོ་བོ་མཆོད།
en: Make offerings to the lords of humans in the future,

source: །དེས་ནི་འདྲེན་པ་བཞུགས་པ་ཐམས་ཅད་རི་མོར་བྱས།
en: And venerate all the guides in the present. {20}

source: །གང་དག་མདོ་སྡེ་འདི་ཐོས་ཟད་པའི་དུས་ལ་འཛིན།
en: “They who hear and retain this sūtra in the degenerate times

source: །དེ་ནི་མཁས་པ་བདེ་བར་གཤེགས་པའི་མཛོད་འཆང་ཡིན།
en: Are wise individuals who possess the treasure of the sugatas.

source: །དེ་ནི་གཟུངས་མཆོག་དག་ལ་རབ་ཏུ་གནས་པ་སྟེ།
en: They are established in the supreme retentions,

source: །དེ་ནི་རིང་པོར་མི་ཐོགས་འཇིག་རྟེན་འདྲེན་པར་འགྱུར།
en: And before long will become guides of the worlds. {21}

source: །གང་གིས་མདོ་སྡེ་འདི་དག་རབ་བཤད་མི་བརྗེད་པ།
en: “They who do not forget but teach this sūtra

source: །མཁས་པ་དེ་ནི་ལོང་བར་ནམས་ཀྱང་མི་འགྱུར་ཏེ།
en: Are wise individuals who will never become blind.

source: །བསྐལ་པ་མང་པོར་ཡན་ལག་མ་ཚང་ཡོང་མི་འགྱུར།
en: Throughout many eons they will not lose a limb,

source: །དེས་ནི་མི་ཁོམ་བརྒྱད་པོ་དག་ཀྱང་རྟག་ཏུ་སྤངས།
en: And will always avoid the eight disadvantageous states. {22}

source: །དེ་ནི་ངན་འགྲོར་ནམ་ཡང་འགྲོ་བར་མི་འགྱུར་ཏེ།
en: “They will never be reborn in the lower existences.

source: །རྟག་ཏུ་མཚན་རྣམས་འཆང་ཞིང་བྱད་བཞིན་བཟང་པོར་འགྱུར།
en: They will always have a beautiful body with the primary signs of a great being.

source: །མངོན་ཤེས་ལྔ་པོ་དེ་དག་རྟག་པར་དེས་བསྒོམས་ཏེ།
en: They will always cultivate the five higher cognitions,

source: །དཔའ་བོ་དེ་ནི་རྟག་ཏུ་བདེ་གཤེགས་སྤྱན་སྔར་གནས།
en: And those heroes will always be in the presence of the sugatas. {23}

source: །ཡེ་ཤེས་ཅན་དེ་འཕྲུལ་པ་མང་པོ་སྤྲུལ་བྱས་ནས།
en: “Endowed with wisdom they will manifest many emanations

source: །ཞིང་རྣམས་བྱེ་བ་མང་པོར་འདུལ་བའི་དོན་ཕྱིར་གཏོང་།
en: That will go to millions of realms to guide beings.

source: །སངས་རྒྱས་སྤྲུལ་པ་མང་པོ་གང་གིས་མཐོང་གྱུར་པ།
en: Of all those who see this multitude of buddha emanations,

source: །དེ་ཡིས་སེམས་ཅན་མང་པོ་བྱང་ཆུབ་མཆོག་ཏུ་བཙུད།
en: That many beings will be brought to supreme enlightenment. {24}

source: །དེ་ནི་དྲན་ལྡན་བློ་གྲོས་ལྡན་ཞིང་ཤེས་རབ་ཅན།
en: Will be endowed with memory, understanding, wisdom, and constancy.

source: །དེ་ནི་རྟག་ཏུ་མཐུ་དང་བརྩོན་འགྲུས་སྟོབས་ཀྱིས་བརྟན།
en: They will become powerful through the strength of their diligence.

source: །གཟི་བརྗིད་ཆེན་པོ་ཆོས་ཀྱི་ཕ་རོལ་ཕྱིན་པར་འགྱུར།
en: They will have great brilliance and they will reach the culmination of the Dharma. {25}

source: །ཟད་པའི་དུས་ལ་ཏིང་འཛིན་ཞི་བ་འཛིན་པ་ནི།
en: They who hold this samādhi of peace in the degenerate time

source: །དཔའ་བོ་དེ་ཡང་ཚངས་པའི་གནས་ལ་ཤིན་ཏུ་གནས།
en: Are heroes established in the brahmavihāras.

source: །དེ་ནི་མྱུར་དུ་ས་ཡང་བརྒྱད་དང་གཉིས་དག་འཐོབ།
en: They quickly attain the eight and two bhūmis,

source: །དེ་ནི་མྱུར་ཞིང་མགྱོགས་པར་བདུད་རྣམས་ཤིན་ཏུ་འདུལ།
en: And swiftly subjugate the māras. {i}

source: །གང་གིས་མདོ་སྡེ་ཞི་བ་འདི་ནི་རྟག་བསྒོམས་པ།
en: Those who always meditate on this sūtra of peace

source: །དབང་དང་ལྡན་ཞིང་མངོན་པར་འཕགས་པ་སྟོབས་དང་ལྡན།
en: Will attain power and possess the highest strengths.

source: །དེ་ནི་སེམས་ཅན་དམ་པ་སེམས་ཅན་དོན་ཕྱིར་བརྩོན།
en: They will always be ones who are intent on benefiting beings,

source: །དེ་ནི་བྱང་ཆུབ་ཤིང་དྲུང་བྱང་ཆུབ་མཆོག་རྟོགས་འགྱུར།
en: And will realize the highest enlightenment at the foot of the Bodhi tree. {ii}

source: །གང་གིས་ཆོས་འདི་རྣམས་ནི་སྟོང་པར་གོམས་བྱས་པ།
en: “Those who meditate that these phenomena are empty

source: །དེ་དག་འོད་ཟེར་བྱེ་བ་སྟོང་རྣམས་རྟག་ཏུ་འགྱེད།
en: Constantly radiate ten billion light rays

source: །ཉི་མའི་དཀྱིལ་འཁོར་དག་ཀྱང་ཐམས་ཅད་གཟི་མེད་བྱས།
en: And eclipse even the disks of the suns.

source: །དཔའ་བོ་དེ་དག་མི་རིང་འཇིག་རྟེན་འདྲེན་པར་འགྱུར།
en: Those heroes will, before long, become guides of the worlds. {26}

source: །ངས་སྔོན་སྤྱོད་ཡུལ་ཞི་བ་འདི་ནི་རབ་ཏུ་བསྒོམས།
en: “In the past I practiced this field of peace

source: །བསྐལ་པ་མང་པོ་བྱེ་བ་ཁྲག་ཁྲིག་སྟོང་དུ་ཡང་།
en: For many quintillions of eons.

source: །ལམ་འདིར་ངས་ནི་ནམ་ཡང་བརྩོན་འགྲུས་རྒྱུན་མ་བཅད།
en: My diligence upon this path was unceasing

source: །དེ་ཚེ་མར་མེ་མཛད་ཀྱིས་རྒྱལ་བར་ལུང་ཡང་བསྟན།
en: And Dīpaṃkara prophesied I would become a jina. {27}

source: །མདོ་སྡེ་འདི་ལ་ཁྱེད་ཀྱང་ང་ཡི་རྗེས་སུ་སློབས།
en: “You also should follow my practice of this sūtra,

source: །ཚུལ་འདི་ཟབ་ཅིང་དམ་པའི་དོན་རྣམས་བསྟན་པ་སྟེ།
en: This teaching that leads to the profound ultimate truth.

source: །འདི་ལ་མུ་སྟེགས་ལོག་པ་མང་པོ་འདི་དག་འཁྱམས།
en: There are many tīrthikas who are lost in error concerning this.

source: །བྱང་ཆུབ་ལ་ནི་སྨད་བྱས་ངན་སོང་འཇིགས་པར་ལྟུང་།
en: They revile enlightenment and fall into the terrible lower realms. {28}

source: །དེ་དག་སྡུག་བསྔལ་མི་བཟད་ཚ་བ་དེར་མྱོང་ནས།
en: They will experience unendurable sufferings of heat.

source: །བསྐལ་པ་ཁྲག་ཁྲིག་མང་པོ་དག་ནི་འདས་ནས་ཀྱང་།
en: And even after many millions of eons have passed

source: །དེ་ནི་དེ་དག་མི་འཆི་འཐོབ་པའི་རྒྱུར་འགྱུར་རོ།
en: They will still not die for that reason. {29}

source: །གང་དག་ཕྱི་དུས་འཇིག་ལ་བདེ་བར་གཤེགས་པ་ཡི།
en: “Those who in the terrible latter times

source: །མདོ་སྡེ་རབ་ཏུ་ཞི་བ་འདི་ནི་སྲུང་བྱེད་པ།
en: Protect this sūtra of the Sugata, this state of peace,

source: །དེ་དག་བྱང་ཆུབ་མཆོག་རབ་འདི་ནི་རྙེད་མི་དཀའ།
en: Will attain the highest enlightenment without difficulty.

source: །དེ་དང་དེ་དག་ཕྱི་དུས་ཆོས་འཛིན་ལུང་བསྟན་ཡིན།
en: They are the prophesied holders of the Dharma in the future.” {30}

source: །ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་ངེས་པར་བསྟན་པའི་ལེའུ་སྟེ་སུམ་ཅུ་རྩ་གཉིས་པའོ།། །།འཕགས་པ་ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོའི་མདོ།
en: Conclusion of the thirty-second chapter, “The Teaching on the Nature of All Phenomena.”

source: བམ་པོ་བཅུ་པ།
en: The Benefits of Possessing the Sūtra Chapter 33

source: དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུ་གྱུར་པ་ལ་བཀའ་སྩལ་པ། གཞོན་ནུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་ལ་མངོན་པར་ཤེས་པ་ཆེན་པོའི་བྱི་དོར་བྱ་བ་ཡོངས་སུ་སྦྱང་བར་འདོད་པས་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པའི་ཏིང་ངེ་འཛིན་འདི་མཉན་པར་བྱ། གཟུང་བར་བྱ། ཀུན་ཆུབ་པར་བྱ། བཅང་བར་བྱ། བཀླག་པར་བྱ། རབ་ཏུ་གདོན་པར་བྱ། ལུང་མནོད་ཅིང་ཁ་ཏོན་དུ་བྱ།
en: Then the Bhagavān said to the youth Candraprabha, “Therefore, young man, bodhisattva mahāsattvas who wish to train in purifying the great higher cognition of all phenomena should listen to the samādhi, the revealed equality of the nature of all phenomena, learn it, understand it, keep it, recite it to others, promote it, proclaim it, chant it, meditate on it with unadulterated meditation, promulgate it, and make it widely known to others.

source: ཉོན་མོངས་པ་མེད་པས་བསྒོམ་པར་བྱ། མང་དུ་བྱ། གཞན་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱའོ། །གཞོན་ནུ་ཆོས་ཐམས་ཅད་ལ་མངོན་པར་ཤེས་པ་ཆེན་པོའི་བྱི་དོར་བྱ་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “Young man, what is the purification of the great higher cognition of all phenomena?

source: ཆོས་ཐམས་ཅད་ལ་ཡོངས་སུ་འཛིན་པ་མེད་ཅིང་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་མཆོག་ཏུ་མི་འཛིན་པ། ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོ་རློམ་སེམས་མེད་པ། ཤེས་རབ་ཀྱི་ཕུང་པོ་རྒྱུ་བ་མེད་པ། རྣམ་པར་གྲོལ་བའི་ཕུང་པོ་དབེན་པར་མཐོང་བ། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བའི་ཕུང་པོ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་མཐོང་བ་སྟེ།
en: It is having no grasping toward all phenomena, it is having no clinging to the aggregate of correct conduct, it is having no pride in the aggregate of samādhi, it is the absence of movement in the aggregate of wisdom, it is having the discerning insight of the aggregate of liberation, and it is seeing correctly as it is the aggregate of the insight of the wisdom of liberation.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མངོན་པར་ཤེས་པ་དེ་དག་དང་ལྡན་པས་ཏིང་ངེ་འཛིན་གྱི་རྣམ་པར་འཕྲུལ་པ་ཐམས་ཅད་ཀྱིས་རྣམ་པར་འཕྲུལ་ཞིང་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་པ་འདི་ནི་གཞོན་ནུ་ཆོས་ཐམས་ཅད་ལ་མངོན་པར་ཤེས་པ་ཆེན་པོའི་བྱི་དོར་བྱ་བ་ཡིན་ནོ།
en: “The bodhisattva mahāsattva who has those higher cognitions manifests all the manifestations of samādhi and teaches the Dharma to beings. “This, young man, is what is called ‘the purification of the great higher cognition of all phenomena.’ ”

source: །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་ཐམས་ཅད་ལ་མངོན་པར་ཤེས་པ་ཆེན་པོའི་བྱི་དོར་བྱ་བ་བསྟན་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བསྟན་ཏོ།
en: Then at that time the Bhagavān gave a detailed Dharma teaching on purifying the great higher cognition of all phenomena by chanting the following extensive verses to the youth Candraprabha:

source: །མངོན་ཤེས་ཆེན་པོ་ཡོངས་སྦྱངས་པ།
en: “The purification of the great higher cognitions

source: །རྩོད་པ་མེད་པར་བསྟན་པ་སྟེ།
en: Is an incontrovertible teaching.

source: །རྩོད་པ་དག་ལ་གང་སྤྱོད་ཅིང་།
en: Someone who practices in contradiction to it

source: །འཛིན་པར་བྱེད་པ་དེ་མི་ཐར།
en: Will not become free of attachment. {1}

source: །མངོན་ཤེས་དེ་ཡི་ཤེས་རབ་སྟེ།
en: “That higher cognition, that wisdom,

source: །སངས་རྒྱས་ཡེ་ཤེས་བསམ་མི་ཁྱབ།
en: Is the inconceivable wisdom of buddhahood.

source: །འཛིན་པ་ལ་ནི་གང་གནས་པ།
en: Someone who remains in attachment

source: །དེ་ལ་ཡེ་ཤེས་ཡོང་མི་འགྱུར། །གང་དག་སྒྲ་ཡིས་བསྟན་པ་ཡི།
en: Will never know that wisdom. {2}

source: །ཆོས་རྣམས་མང་པོ་བསམ་མི་ཁྱབ།
en: “The numerous inconceivable Dharmas Are taught by using words.

source: །སྒྲ་དེ་ལ་ཡང་གང་ཆགས་པ།
en: Someone who is attached to words

source: །དགོངས་པའི་བཤད་པ་མི་ཤེས་སོ།
en: Will not know the meaning of the teaching. {3}

source: །ཅི་ལ་དགོངས་ཏེ་བཤད་པ་ཡི།
en: “How can someone teach the meaning

source: །དགོངས་པ་དག་ནི་མི་ཤེས་པ།
en: Who does not know the meaning behind the words?

source: །ཆོས་ཉིད་ལ་ནི་མ་བསླབས་པས། །ཆོས་མ་ཡིན་པ་ཆོས་སུ་འཆད།
en: Someone who has not learned what the true nature is Teaches that which is not the Dharma as the Dharma. {4} “The one meaning of the differing words Of the sūtras that have been taught by me

source: །འཇིག་རྟེན་ཁམས་ནི་སྟོང་དག་ཏུ། །ངས་ནི་མདོ་སྡེ་གང་བཤད་པ། །ཚིག་འབྲུ་ཐ་དད་དོན་གཅིག་སྟེ།
en: Within thousands of worlds

source: །ཐམས་ཅད་བརྗོད་པར་ནུས་མ་ཡིན།
en: Is something that cannot be stated. {5}

source: །ཚིག་གཅིག་རྣམ་པར་བསྒོམས་ན་ནི།
en: “Through contemplating a single word

source: །དེ་དག་ཐམས་ཅད་བསྒོམས་པར་འགྱུར། །སངས་རྒྱས་ཇི་སྙེད་ཐམས་ཅད་ཀྱིས། །ཆོས་རྣམས་མང་པོ་རབ་བཤད་པ།
en: All of them will be meditated on— All of the many kinds of Dharma that have been taught By however many buddhas there have been. {6} “For people who have mastered the meaning

source: །ཆོས་རྣམས་ཐམས་ཅད་སྟོང་པ་ཉིད།
en: That all phenomena are selfless,

source: །མི་གང་དོན་ལ་མཁས་པ་དག །ཚིག་འདི་བསླབས་པར་གྱུར་པ་ལ།
en: When they have learned this word

source: །སངས་རྒྱས་ཆོས་རྣམས་དཀོན་མ་ཡིན།
en: The Dharmas of the Buddha will not be hard to attain. {7}

source: །ཆོས་ཀུན་སངས་རྒྱས་ཆོས་ཡིན་ཏེ། །ཆོས་ཉིད་ལ་ཡང་གང་བསླབས་པ།
en: “All phenomena are the Buddha’s Dharma. They who have learned the nature of phenomena,

source: །ཆོས་ཉིད་རབ་ཏུ་ཤེས་པ་ནི།
en: They know the nature of phenomena

source: །ཆོས་ཉིད་དང་ཡང་འགལ་མི་བྱེད།
en: And do not contradict the nature of phenomena. {8}

source: །ཚིག་ཀུན་ཀྱང་ནི་སངས་རྒྱས་ཚིག །སྒྲ་ཀུན་དངོས་པོ་མེད་པ་སྟེ།
en: “All words are the Buddha’s words, As all words have no substance.

source: །ཕྱོགས་བཅུ་དག་ཏུ་བཙལ་ན་ཡང་།
en: Although one seeks them in the ten directions

source: །སངས་རྒྱས་ཚིག་ནི་མི་རྙེད་དོ།
en: The words of the Buddha will not be found. {9}

source: །ཚིག་འདི་སངས་རྒྱས་ཚིག་ཡིན་ཏེ།
en: “These words are the Buddha’s words.

source: །ཕྱོགས་བཅུ་དག་ཏུ་རབ་བཙལ་ཀྱང་།
en: Though one seeks them in the ten directions,

source: །བླ་མེད་འདི་ནི་མི་རྙེད་དོ།
en: These unsurpassable words are not to be found.

source: །མ་རྙེད་རྙེད་པར་མི་འགྱུར་རོ།
en: They have never been found and never will be found. {10}

source: །སངས་རྒྱས་ཚིག་ནི་བླ་ན་མེད།
en: “The Buddha’s words are unsurpassable.

source: །ལྟག་ན་མེད་པ་སངས་རྒྱས་ཚིག །དེ་ལ་རྡུལ་ཙམ་མི་རྙེད་པས།
en: There is nothing higher than the Buddha’s words. There is not an atom of them that is to be found,

source: །དེ་ཚེ་བླ་ན་མེད་ཅེས་བརྗོད།
en: And that is why they are called unsurpassable. {11}

source: ཆོས་ནི་རྡུལ་ཙམ་མི་སྐྱེ་སྟེ།
en: “An atom, a phenomenon, is not produced.

source: །རྡུལ་ཙམ་སྒྲར་ནི་བཤད་པ་ཡིན།
en: Although explanations use the term ‘atom,’

source: །རྡུལ་ཙམ་རྙེད་པར་མ་གྱུར་ཀྱང་།
en: Something the size of an atom cannot be found;

source: །འཇིག་རྟེན་དུ་ནི་སྒྲ་ཡིས་བཤད།
en: It is a term used in teaching on the worldly level. {12}

source: །ཆོས་རྣམས་རྙེད་མེད་རྙེད་པ་སྟེ།
en: “The unfindability of phenomena is found,

source: །རྙེད་པ་ལ་ཡང་རྙེད་པ་མེད།
en: But that finding also cannot be found.

source: །དེ་ལྟར་ཆོས་རྣམས་གང་ཤེས་པ།
en: Thus they who know phenomena

source: །བྱང་ཆུབ་དམ་པ་རྟོགས་པར་འགྱུར།
en: Realize the highest enlightenment, {13}

source: །བྱང་ཆུབ་བླ་མེད་ངེས་རྟོགས་ནས།
en: “And having realized the highest enlightenment

source: །ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར།
en: They will turn the wheel of the Dharma.

source: །ཆོས་ཀྱི་འཁོར་ལོ་རབ་བསྐོར་ནས།
en: Through turning the wheel of the Dharma

source: །སངས་རྒྱས་ཆོས་རྣམས་སྟོན་པར་བྱེད། །སངས་རྒྱས་ཡེ་ཤེས་བླ་མེད་ནི།
en: They teach the Buddha’s Dharma. {14}
